-- Під час виконання критичної операції з рахунком (наприклад, переказу коштів) потрібно одразу знати, 
-- чи можливо заблокувати конкретний рядок. Якщо рядок вже заблоковано іншою транзакцією, замість очікування 
-- ви хочете миттєво отримати помилку — і прийняти альтернативне рішення (наприклад, спробувати пізніше або повідомити користувача)

-- Завдання:
-- Спробуйте отримати блокування для рахунку з id = 2, щоб у разі зайнятості 
-- рядка одразу отримати повідомлення про неможливість блокування.

BEGIN;
-- Рішення
SELECT * FROM accounts WHERE id = 2 FOR UPDATE NOWAIT;
-- Увага: не виконуйте COMMIT, щоб транзакції залишались заблокованими