-- Уявіть, що кілька робітників одночасно обробляють транзакції зі статусом 'pending'. 
-- Щоб уникнути конфліктів і подвійної обробки, кожен робітник повинен заблокувати 
-- лише одну незаблоковану транзакцію, і пропустити ті, що вже обробляються іншими.

-- Завдання:
-- Напишіть SQL-запит, який вибирає одну транзакцію зі статусом 'pending', блокує її для обробки та 
-- пропускає вже заблоковані рядки (наприклад, іншими сесіями).

-- Рішення
SELECT * FROM transactions WHERE status = 'pending' FOR UPDATE SKIP LOCKED LIMIT 1;