-- Ви реалізуєте переказ коштів між двома рахунками: з рахунку №10 на рахунок №20. Щоб уникнути race condition, 
-- де кілька транзакцій одночасно намагаються змінити баланси, потрібно використати блокування рядків (row-level lock) 
-- для обох рахунків у стабільному порядку (за id)

-- Це забезпечить узгодженість даних та унікальність обробки.

-- Завдання:
-- Заблокуйте рахунки з id=10 та id=20 для оновлення, зменшіть баланс на рахунку 10 (якщо достатньо коштів), і збільште на рахунку 20

BEGIN;

-- Увага: не виконуйте COMMIT, щоб транзакції залишались заблокованими