-- Уявіть, що кілька процесів одночасно оновлюють відсоткові ставки по кредитах (таблиця loans). 
--Якщо ці процеси блокують записи у довільному порядку, це може призвести до взаємоблокування (deadlock). 
--Щоб цього уникнути, потрібно завжди блокувати рядки у фіксованому порядку — наприклад, за зростанням id.

-- Оновіть відсоткові ставки (interest_rate) одночасно у двох кредитів (id = 1 і id = 2), 
-- заблокувавши їх у порядку зростання id, щоб уникнути взаємоблокування.
-- Використовуйте транзакцію та команду FOR UPDATE для блокування обох рядків перед оновленням.

BEGIN;
-- Рішення

-- Увага: не виконуйте COMMIT, щоб транзакції залишались заблокованими