-- Адміністратор бази даних планує провести обслуговування таблиці accounts — наприклад, 
-- змінити її структуру або оновити важливі дані. Щоб гарантувати, що жодна інша транзакція не змінить 
-- або не зчитає дані з цієї таблиці під час обслуговування, необхідно повністю заблокувати її для всіх операцій

-- Завдання:
-- Заблокуйте таблицю accounts для будь-яких змін (insert/update/delete/select), використовуючи найсуворіший рівень блокування

BEGIN;
-- Рішення

-- Увага: не виконуйте COMMIT, щоб транзакції залишались заблокованими