-- Опис:
-- -- У банківській системі або системі фінансової обробки декілька процесів можуть одночасно намагатися обробляти нові транзакції. 
-- Щоб уникнути ситуації, коли одна транзакція обробляється кількома процесами одночасно, необхідно блокувати відібрані записи, 
-- але пропускати ті, які вже заблоковані іншими процесами

-- Завдання:
-- Обрати 5 транзакцій зі статусом 'pending' для обробки, пропускаючи ті, які вже обробляються іншими процесами

-- Рішення
SELECT *
FROM transactions
WHERE status = 'pending'
FOR UPDATE SKIP LOCKED
LIMIT 5;