-- Ви реалізуєте переказ коштів між двома рахунками: з рахунку №10 на рахунок №20. Щоб уникнути race condition, 
-- де кілька транзакцій одночасно намагаються змінити баланси, потрібно використати блокування рядків (row-level lock) 
-- для обох рахунків у стабільному порядку (за id)

-- Це забезпечить узгодженість даних та унікальність обробки.

-- Завдання:
-- Заблокуйте рахунки з id=10 та id=20 для оновлення, зменшіть баланс на рахунку 10 (якщо достатньо коштів), і збільште на рахунку 20


SELECT * FROM accounts WHERE id IN (10, 20) ORDER BY id;
UPDATE accounts SET balance = balance - 500 WHERE id = 10 AND balance >= 500;
UPDATE accounts SET balance = balance + 500 WHERE id = 20;
-- Увага: не виконуйте COMMIT, щоб транзакції залишались заблокованими