-- Під час фінансової транзакції (наприклад, поповнення рахунку) потрібно оновити баланс лише одного запису (рахунку). 
-- Щоб уникнути конфлікту з іншими транзакціями, які можуть одночасно змінювати той самий рахунок, слід встановити рядкове блокування.

-- Завдання:
-- Отримаєте блокування лише одного рядка з accounts, де id = 1, і безпечно збільшіть його баланс на 50.

BEGIN;
-- Рішення
SELECT * FROM accounts WHERE id = 1 FOR UPDATE;
UPDATE accounts SET balance = balance + 50 WHERE id = 1;
-- Увага: не виконуйте COMMIT, щоб транзакції залишались заблокованими